[M_Nast_Vday MissionDefinition]
MissionDescription="Moxxi has summoned you to [place]Rotgut Distillery[-place] -- sounds like she needs some help with the old Hodunk/Zaford rivalry. Better find her."
TeaserText="Two houses, both alike in dignity..."

[M_Nast_Vday:BringBabyBackSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Moxxi has summoned you to [place]Rotgut Distillery[-place] to end the Zaford/Hodunk rivalry.<br><br>Her plan is to oversee the marriage of two goliaths -- one Zaford, one Hodunk -- and in so doing bring peace to the warring families. Unfortunately, it appears that the goliaths (Bridget Hodunk and Colin Zaford) hate one another and have no intention of getting married. Luckily, Moxxi has another plan: she wants you to brew an old Hodunk family love potion to get the bride and groom interested in one another.<br><br>But before you deliver the potion to the unhappy couple, perhaps you should leave the baby somewhere safe."

[M_Nast_Vday:ClearOutHodunkVillageSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Moxxi has summoned you to [place]Rotgut Distillery[-place] to end the Zaford/Hodunk rivalry.<br><br>Her plan is to oversee the marriage of two goliaths -- one Zaford, one Hodunk -- and in so doing bring peace to the warring families. Unfortunately, it appears that the goliaths (Bridget Hodunk and Colin Zaford) hate one another and have no intention of getting married. Luckily, Moxxi has another plan: she wants you to brew an old Hodunk family love potion to get the bride and groom interested in one another.<br><br>The potion will require something NEW, something OLD, something BORROWED and something GOLD. Having stolen a baby, the Hodunks kind of want you dead. Take 'em out."

[M_Nast_Vday:CreateLovePotionIntroObjective MissionObjectiveSetDefinition]
MissionDescriptionOverride="Moxxi has summoned you to [place]Rotgut Distillery[-place] to end the Zaford/Hodunk rivalry.<br><br>Her plan is to oversee the marriage of two goliaths -- one Zaford, one Hodunk -- and in so doing bring peace to the warring families. Unfortunately, it appears that the goliaths (Bridget Hodunk and Colin Zaford) hate one another and have no intention of getting married. Luckily, Moxxi has another plan: she wants you to brew an old Hodunk family love potion to get the bride and groom interested in one another.<br><br>The potion will require something NEW, something OLD, something BORROWED and something GOLD.<br><br>Ellie, Moxxi's daughter, knows where to find something that will take care of two ingredients at once. She's asked you to head to a particular set of coordinates."

[M_Nast_Vday:DestroyTheGoldLoaderSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Moxxi has summoned you to [place]Rotgut Distillery[-place] to end the Zaford/Hodunk rivalry.<br><br>Her plan is to oversee the marriage of two goliaths -- one Zaford, one Hodunk -- and in so doing bring peace to the warring families. Unfortunately, it appears that the goliaths (Bridget Hodunk and Colin Zaford) hate one another and have no intention of getting married. Luckily, Moxxi has another plan: she wants you to brew an old Hodunk family love potion to get the bride and groom interested in one another.<br><br>The potion will require something NEW, something OLD, something BORROWED and something GOLD.<br><br>Having stolen a baby (NEW and BORROWED), and some aged whiskey (OLD), you only have one ingredient left: something GOLD.<br><br>You found a pot of gold, but a BLNG Loader jumped out of it. You'll need to kill him and take part of his body as your ''something GOLD''."

[M_Nast_Vday:DrinkSomeWhiskeySet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Moxxi has summoned you to [place]Rotgut Distillery[-place] to end the Zaford/Hodunk rivalry.<br><br>Her plan is to oversee the marriage of two goliaths -- one Zaford, one Hodunk -- and in so doing bring peace to the warring families. Unfortunately, it appears that the goliaths (Bridget Hodunk and Colin Zaford) hate one another and have no intention of getting married. Luckily, Moxxi has another plan: she wants you to brew an old Hodunk family love potion to get the bride and groom interested in one another.<br><br>The potion will require something NEW, something OLD, something BORROWED and something GOLD.<br><br>Having stolen a baby (thus making it count as something both NEW and BORROWED), Moxxi has recommended you head to the Zaford Distillery and get some aged whiskey (something OLD).<br><br>As it stands, however, there's a LOT of whiskey in the distillery. You'll need to start taste-testing to see which one holds the real high-quality stuff."

[M_Nast_Vday:FindSomethingGoldHiddenLoaderSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Moxxi has summoned you to [place]Rotgut Distillery[-place] to end the Zaford/Hodunk rivalry.<br><br>Her plan is to oversee the marriage of two goliaths -- one Zaford, one Hodunk -- and in so doing bring peace to the warring families. Unfortunately, it appears that the goliaths (Bridget Hodunk and Colin Zaford) hate one another and have no intention of getting married. Luckily, Moxxi has another plan: she wants you to brew an old Hodunk family love potion to get the bride and groom interested in one another.<br><br>The potion will require something NEW, something OLD, something BORROWED and something GOLD.<br><br>Having stolen a baby (NEW and BORROWED), and some aged whiskey (OLD), you only have one ingredient left: something GOLD."

[M_Nast_Vday:FindSomethingOldSet1 MissionObjectiveSetDefinition]
MissionDescriptionOverride="Moxxi has summoned you to [place]Rotgut Distillery[-place] to end the Zaford/Hodunk rivalry.<br><br>Her plan is to oversee the marriage of two goliaths -- one Zaford, one Hodunk -- and in so doing bring peace to the warring families. Unfortunately, it appears that the goliaths (Bridget Hodunk and Colin Zaford) hate one another and have no intention of getting married. Luckily, Moxxi has another plan: she wants you to brew an old Hodunk family love potion to get the bride and groom interested in one another.<br><br>The potion will require something NEW, something OLD, something BORROWED and something GOLD.<br><br>Having stolen a baby (thus making it count as something both NEW and BORROWED), Moxxi has recommended you head to the Zaford Distillery and get some aged whiskey (something OLD)."

[M_Nast_Vday:HeadBackToPreacherSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Moxxi has summoned you to [place]Rotgut Distillery[-place] to end the Zaford/Hodunk rivalry.<br><br>Her plan is to oversee the marriage of two goliaths -- one Zaford, one Hodunk -- and in so doing bring peace to the warring families. Unfortunately, it appears that the goliaths (Bridget Hodunk and Colin Zaford) hate one another and have no intention of getting married. Luckily, Moxxi has another plan: she wants you to brew an old Hodunk family love potion to get the bride and groom interested in one another.<br><br>Having mixed the potion successfully, you need only return to the wedding and give it to the blushing bride and groom. Then, the wedding should begin."

[M_Nast_Vday:KillBrideAndGroomSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Moxxi has summoned you to [place]Rotgut Distillery[-place] to end the Zaford/Hodunk rivalry.<br><br>Her plan is to oversee the marriage of two goliaths -- one Zaford, one Hodunk -- and in so doing bring peace to the warring families.<br><br>Unfortunately, your efforts to make sure the wedding went off without a hitch resulted in what could charitably be called the biggest possible hitch. When the bride and groom took off their helmets to kiss one another, they (being goliaths) went completely insane and now want to kill you. You'll have to kill them."

[M_Nast_Vday:LeadRobotSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Moxxi has summoned you to [place]Rotgut Distillery[-place] to end the Zaford/Hodunk rivalry.<br><br>Her plan is to oversee the marriage of two goliaths -- one Zaford, one Hodunk -- and in so doing bring peace to the warring families. Unfortunately, it appears that the goliaths (Bridget Hodunk and Colin Zaford) hate one another and have no intention of getting married. Luckily, Moxxi has another plan: she wants you to brew an old Hodunk family love potion to get the bride and groom interested in one another.<br><br>The potion will require something NEW, something OLD, something BORROWED and something GOLD.<br><br>Having stolen a baby (thus making it count as something both NEW and BORROWED), Moxxi has recommended you head to the Zaford Distillery and get some aged whiskey (something OLD).<br><br>The distillery was locked up tight, but a lovelorn robot helped you breach the perimeter. Just stick with him and help him find his robot girlfriend, and then you'll be free to find the OLD whiskey."

[M_Nast_Vday:PickUpMixingPotionSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Moxxi has summoned you to [place]Rotgut Distillery[-place] to end the Zaford/Hodunk rivalry.<br><br>Her plan is to oversee the marriage of two goliaths -- one Zaford, one Hodunk -- and in so doing bring peace to the warring families. Unfortunately, it appears that the goliaths (Bridget Hodunk and Colin Zaford) hate one another and have no intention of getting married. Luckily, Moxxi has another plan: she wants you to brew an old Hodunk family love potion to get the bride and groom interested in one another.<br><br>The potion will require something NEW, something OLD, something BORROWED and something GOLD.<br><br>Now that you've mixed the potion, you just need to grab it."

[M_Nast_Vday:PrepareLovePotionMix MissionObjectiveSetDefinition]
MissionDescriptionOverride="Moxxi has summoned you to [place]Rotgut Distillery[-place] to end the Zaford/Hodunk rivalry.<br><br>Her plan is to oversee the marriage of two goliaths -- one Zaford, one Hodunk -- and in so doing bring peace to the warring families. Unfortunately, it appears that the goliaths (Bridget Hodunk and Colin Zaford) hate one another and have no intention of getting married. Luckily, Moxxi has another plan: she wants you to brew an old Hodunk family love potion to get the bride and groom interested in one another.<br><br>The potion will require something NEW, something OLD, something BORROWED and something GOLD.<br><br>Now that you have all the ingredients, you just need to mix the potion."

[M_Nast_Vday:TalkToBrideAndGroomSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Moxxi has summoned you to [place]Rotgut Distillery[-place] to end the Zaford/Hodunk rivalry. Her plan is to oversee the marriage of two goliaths -- one Zaford, one Hodunk -- and in so doing bring peace to the warring families.<br><br>She's asked you to find the would-be bride and groom and protect them until the wedding goes through."

[M_Nast_Vday:TalkToRobotSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Moxxi has summoned you to [place]Rotgut Distillery[-place] to end the Zaford/Hodunk rivalry.<br><br>Her plan is to oversee the marriage of two goliaths -- one Zaford, one Hodunk -- and in so doing bring peace to the warring families. Unfortunately, it appears that the goliaths (Bridget Hodunk and Colin Zaford) hate one another and have no intention of getting married. Luckily, Moxxi has another plan: she wants you to brew an old Hodunk family love potion to get the bride and groom interested in one another.<br><br>The potion will require something NEW, something OLD, something BORROWED and something GOLD.<br><br>Having stolen a baby (thus making it count as something both NEW and BORROWED), Moxxi has recommended you head to the Zaford Distillery and get some aged whiskey (something OLD).<br><br>The distillery seems to be locked up tight, but a lovelorn robot outside the front gates may be able to get you inside. Just convince him to go rescue his robotic girlfriend inside the distillery and he should open the way for you."

[M_Nast_Vday:WhatToFindNextGoldSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Moxxi has summoned you to [place]Eros Elevation[-place] to end the Zaford/Hodunk rivalry.<br><br>Her plan is to oversee the marriage of two goliaths -- one Zaford, one Hodunk -- and in so doing bring peace to the warring families. Unfortunately, it appears that the goliaths (Bridget Hodunk and Colin Zaford) hate one another and have no intention of getting married. Luckily, Moxxi has another plan: she wants you to brew an old Hodunk family love potion to get the bride and groom interested in one another.<br><br>The potion will require something NEW, something OLD, something BORROWED and something GOLD.<br><br>Having stolen a baby (NEW and BORROWED), and some aged whiskey (OLD), you only have one ingredient left: something GOLD. Search the distillery."
